xfire-aegis/src/test/org/codehaus/xfire/aegis/type/collection/ReceiveDoubles.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
 <env:Header/>
 <env:Body>
  <receiveDoubles xmlns="http://collection.type.aegis.xfire.codehaus.org">
    <doubles xmlns:d="urn:double">
      <d:double>1.0</d:double>
    </doubles>
  </receiveDoubles>
 </env:Body>
</env:Envelope>